References/ASTT/TestSuits/Tests/DeviceDiscovery/TC.DD.NVT.01/TC.DD.NVT.01_REQ_01.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery"
               xmlns:wsadis="http://schemas.xmlsoap.org/ws/2004/08/addressing"
               xmlns:dn="http://www.onvif.org/ver10/network/wsdl">
  <soap:Header>
    <wsadis:MessageID>uuid:09b6ad04-4c7d-49da-afb9-cc9c8963b106</wsadis:MessageID>
    <wsadis:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsadis:To>
    <wsadis:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Probe</wsadis:Action>
  </soap:Header>
  <soap:Body>
    <d:Probe>
      <d:Types />
      <d:Scopes />
    </d:Probe>
  </soap:Body>
</soap:Envelope>



